// pages/bangzhufankui/bangzhufankui.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    show: false,
    animationData: "", //动画
    ide:0, //索引
    height: "155%",
    topNum:"", //回到顶部
    list:[
      {
        id:1,
        title:'1.储值会员',
        team:[
          {q:'如何成为储值会员',a:'我们目前的充值渠道有：1、本app“首页-储值会员”内点击“立即充值”；2、微信搜索小程序“帷幄停车Lite”点击主页的“会员充值”'},
          {q:'如何使用余额支付停车费（出场无感支付）',a:'非会员用户需要完成一次储值会员充值，并绑定车牌号，便可在已开通帷幄支付的停车场享受储值会员车出场，使用账户余额付款，无感支付功能。'},
          {q:'哪些停车场已经开通帷幄支付',a:'所有在地图中标记为“空”和“满”的停车场均为已经开通帷幄支付的停车场。'},
          {q:'如绑定多个车牌是否同时都享有储值会员权益',a:'若绑定的车辆都进入开通帷幄支付的停车场，只有最先入场的车辆享受储值会员权益，当会员车出场后，第二辆入场车辆才能享受储值会员权益，以此类推。'},
          {q:'会员车辆出场时余额不够怎么办',a:' 账户余额不足，储值会员仍可正常出场，但出场后，app会自动锁定，短信提醒用户账户余额不足并暂停用户的会员服务，直至用户支付未完成订单后，恢复其会员服务。'},
          {q:'绑定车辆未驶入停车场但收到了入场通知',a:'有多种原因可能会造成此类情况，如套牌车辆、识别错误、系统异常等。当发生此类情况时，请及时通过客服电话、用户反馈等渠道与我们联系，以免对您造成损失。'},
          {q:'储值会员如何退款',a:'充值成功后如需退款，请与我们的售后人员联系0351-2526206'}
        ]
      },
      {
        id:2,
        title:"2.PLUS会员",
        team:[
          {q:'如何成为PLUS会员',a:'在本app“首页-PLUS会员”内点击“立即开通”完成购买。'},
          {q:'开通PLUS会员后没有发放停车券和加油金',a:'请稍后尝试或关闭app重新打开。'},
          {q:'购买停车劵或5折洗车券支付时取消支付，后发现权限已经被消耗',a:'请联系我们的客服处理（0351-2526206）或点击右上角的问题反馈描述情况'},
          {q:'帷幄自营停车场停车劵提示使用成功但是出场未减免',a:'请联系我们的客服处理（0351-2526206）或点击下方用户反馈按钮描述情况'},
          {q:'使用加油券无法成功减免',a:'请联系我们的客服处理（0351-2526206）或点击下方用户反馈按钮描述情况'},
          {q:'PLUS会员是否可以退款',a:'根据开通时的会员协议，PLUS会员不可退款'},
          {q:' PLUS会员已经购买的优惠券是否可以退款',a:'优惠券一旦购买无法退款'},
          {q:'开通、续费PLUS会员的费用如何开具发票',a:'请联系我们客服处理（0351-2526206）'},
          {q:'PLUS会员使用过停车券后超出费用如何开具发票',a:'使用停车券后超出费用如需要开具发票请向停车场索要'},
          {q:'合作洗车店、停车场的数量还会增加么',a:'我们会和其他厂商合作，增加可供选择的洗车店、停车场'}
        ]
      },
      {
        id:3,
        title:"3.其他",
        team:[
          {q:'为什么收不到验证码短信',a:'网络通讯出现异常情况可能会造成短信丢失或延时收到，需要您耐心等待，同时建议您检查一下手机是否拦截短信等设置，是否跟运营商反馈过垃圾短信等，如果您始终无法收到，您可以通过“用户反馈”给我们留言，或致电0351-2526206咨询。'},
          {q:'如何使用微信公众号支付',a:'关注“帷幄智能”公众号，使用微信扫描停车场内标有“帷幄停车”标志的微信二维码，完成一次支付后，同一车辆再次进入该停车场时，系统会通过该公众号想用户发送入场通知，出场时间点击该通知即可进入支付页面，支付完成后半小时内，出场无需付款（为保证您可以顺利出场，支付完成后到车辆出场前请至少间隔1分钟）'},
          {q:'如何使用停车场内扫码支付',a:'使用微信扫描停车场内标有“帷幄停车”标志的微信二维码，输入车牌号完成支付后半小时内，出场无需付款，快速出场（为保证您可以顺利出场，支付完成后到车辆出场前请至少间隔1分钟）'},
          {q:'如何使用岗亭扫码支付',a:'用户到达岗亭后，若扫码岗亭标有“帷幄停车”标志的微信二维码，打开的连接会自动填写当前岗亭内的车牌后，完成支付后自动抬杆放行'}
        ]
      }
    ]
  },
  tofankui() {
    wx.navigateTo({
      url: '../fankui/fankui',
    })
  },
  //动画
  toani() {
    var animation = wx.createAnimation({
      duration: 1000,
      timingFunction: 'ease',
    })
    if (this.data.show) {
      this.setData({
        show: false,
      })
      animation.height(100 + 'rpx').step()

    } else {
      this.setData({
        show: true,
      })
      animation.height(75 + '%').step()
    }
    this.setData({
      animationData: animation.export()
    })
  },
  //列表展示
  toli(e){
    var {id} = e.currentTarget
    console.log(id)
    if(this.data.ide == id){
      this.setData({
        ide:0
      })
    }else{
      this.setData({
        ide:id
      })
    }
    this.setData({
      topNum:0
    })
    // const query = wx.createSelectorQuery()                // 创建节点查询器 query
    // query.selectAll('.li').boundingClientRect(res => {
    //   var sum = res.reduce((v,i)=>{
    //     return v+i.height
    //   },0)
    //   this.setData({
    //     height:(sum+530)*2 + 'rpx'
    //   })
    // })    // 这段代码的意思是选择class=lists的节点，获取节点位置信息的查询请求
    // query.exec()
  },

})